Tekla Open API Reference for Tekla Structures 2025
Double Implicit Conversion (Double to Double)
 Converts from Datatype.Double to double.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static implicit operator double (
	Double From
)
Public Shared Widening Operator CType (
	From As Double
) As Double
Parameters
From
Type: Tekla.Structures.Datatype.Double
The value to be converted.
Return Value
Type: Double
The converted double value.
See Also
Reference
Double Structure
Implicit Overload
Tekla.Structures.Datatype Namespace